{
    "nav": {
        "skills": "Skills",
        "projects": "Projects",
        "education": "Education",
        "contact": "Contact"
    },
    "header": {
        "title": "Boubacar Konaté",
        "subtitle": "Web Developer",
        "description": "After a fulfilling career in social work, I chose to redirect my skills toward web and mobile development. Driven by a desire to help others, I aim to design modern and accessible technological solutions. My soft skills, such as listening, curiosity, problem-solving, and collaboration, enable me to create user-focused applications that combine technology with social impact."
    },
    "competences": {
        "title": "Technical Skills",
        "design": "Design",
        "technologies": "Technologies",
        "others": "Others"
    },
    "projects": {
        "title": "Some Completed Projects",
        "etalent": {
            "description": "Developed in PHP with the Symfony framework and MySQL database, this e-commerce site follows the Model-View-Controller pattern to ensure a clear and maintainable architecture. The integration of the Stripe API allows for subscribing to various online plans."
        },
        "todolist": {
            "description": "Responsive web application for task management, developed using the React framework, Bootstrap CSS framework, and PostgreSQL database. This application enables users to create, organize, and track their tasks in an intuitive manner, featuring a modern and dynamic interface that adapts seamlessly to different devices."
        },
        "travelBlog": {
            "description": "Travel blog developed in React with TypeScript, ensuring better type management and improved code maintainability, and Tailwind CSS for a modern interface. The application consumes an external API to dynamically display travel articles."
        },
        "talentMatch": {
            "description": "This web application helps identify digital talents through a detailed questionnaire. Developed with the React framework, it integrates the 'apiTalentMatch' REST API for advanced and precise candidate searches. State management and the useContext provider are utilized effectively."
        },
        "taskMaster": {
            "description": "A task management application built with Next.js, the Prisma ORM, and a MySQL database. The modern design is created with Tailwind CSS, and efficient API routes ensure effective task management: create, read, update, and delete."
        },
        "apiRest": {
            "description": "REST API developed with Node.js and Express.js, designed to ensure the proper functioning of the Talent Match application. This API handles GET requests to manage digital professional profiles and questionnaire data. It also facilitates smooth data interaction between the application's frontend and backend."
        },
        "adei": {
            "description": "Project focused on providing sustainable and responsible IT solutions. Initially built with the Symfony framework, the site was later entirely redesigned in WordPress for more flexible content management and better accessibility."
        },
        "flashnet75": {
            "description": "A business showcase website developed with WordPress, designed to promote cleaning services for both individuals and companies. Advanced customization was done with HTML and CSS, creating a design tailored to the company's identity."
        },
        "weCare": {
            "description": "A mobile application facilitating communication between healthcare and social institutions and families, developed with React Native and Firebase. This application integrates the MVVM pattern and offers features such as a secure messaging system."
        },
        "projetJs": {
            "description": "A project featuring a collection of small interactive functionalities developed in pure HTML, CSS, and JavaScript, such as a calculator, a currency converter, a note manager, and simple games like Rock-Paper-Scissors. These projects explore key concepts in JavaScript."
        },
        "erpSocial": {
            "description": "ERP Social is a test application for team and product management. It is built with Next.js and TypeScript, featuring a modern interface designed with Tailwind CSS. Authentication is handled via Clerk, online payments are processed with Stripe, and data management is powered by PostgreSQL."
        }


    },
    "formations": {
        "title": "Education and Curriculum Vitae",
        "certifications": [
            "2024: Application Designer and Developer Certification",
            "2023: Web and Mobile Developer Certification",
            "2022: Openclassrooms (HTML / PHP / JS)"
        ],
        "cv": "Download CV"
    },
    "contact": {
        "description": "Find me on my social networks or send me an email."
    }
}
