{
    "nav": {
        "skills": "Compétences",
        "projects": "Projets",
        "education": "Formations",
        "contact": "Contact"
    },
    "header": {
        "title": "Boubacar Konaté",
        "subtitle": "Développeur web",
        "description": "Après une carrière enrichissante dans le travail social, j'ai choisi d'orienter mes compétences au service du développement web et mobile. Animé par le désir d’aider les autres, j'ai comme volonté de concevoir des solutions technologiques modernes et accessibles. Mes soft skills, tels que l'écoute, la curiosité, la résolution de problèmes et la collaboration, me permettent de créer des applications orientées utilisateur, combinant technologie et impact social."
    },
    "competences": {
        "title": "Compétences techniques",
        "design": "Design",
        "technologies": "Technologies",
        "others": "Autres"
    },
    "projects": {
        "title": "Quelques projets réalisés",
        "etalent": {
            "description": "Développé en PHP avec le framework Symfony et la base de données MySQL, ce site e-commerce adopte le pattern Model-View-Controller pour garantir une architecture claire et maintenable. L'intégration de l'API Stripe permet de souscrire à divers abonnements en ligne."
        },
        "todolist": {
            "description": "Application web responsive de gestion de tâches, développée avec le framework React et le framework CSS Bootstrap et la base de données PostgreSQL. Cette application permet aux utilisateurs de créer, organiser et suivre leurs tâches de manière intuitive, avec une interface moderne et réactive."
        },
        "travelBlog": {
            "description": "Blog de voyage développé en React avec TypeScript,qui assure une meilleure gestion des types et améliore la maintenabilité du code, et Tailwind CSS pour une interface moderne. L'application consomme une API externe pour afficher dynamiquement des articles de voyage."
        },
        "talentMatch": {
            "description": "Cette application web aide à identifier les talents du digital via un questionnaire détaillé. Développée avec le framework React, elle intègre l'API REST 'apiTalentMatch' pour une recherche avancée et précise des candidats. Grâce à la gestion d'états et à l'utilisation du provider useContext."
        },
        "apiRest": {
            "description": "API REST développée en Node.js et Express.js, conçue pour le bon fonctionnement de l'application Talent Match. Cette API répond à des requêtes GET pour gèrer les profils des professionnels digitaux ainsi que les données du questionnaire utilisé pour la recherche de talents."
        },
        "adei": {
            "description": "Projet dédié à la fourniture de services de solutions informatiques durables et responsables. Initialement développé avec le framework Symfony, le site a ensuite fait l'objet d'une refonte complète en WordPress pour permettre une gestion plus flexible du contenu et une meilleure accessibilité."
        },
        "taskMaster": {
            "description": "Une application de gestion des tâches réalisée avec Next.js, l'ORM Prisma, et une base de données MySQL. Le design moderne est conçu avec Tailwind CSS, et des routes API performantes assurent une gestion efficace des tâches : création, lecture, mise à jour et suppression."
        },
        "flashnet75": {
            "description": "Site vitrine professionnel développé avec WordPress, conçu pour promouvoir les services de nettoyage auprès des particuliers et des entreprises. Une personnalisation avancée a été réalisée avec HTML et CSS, permettant de créer un design adapté à l'identité de l'entreprise."
        },
        "weCare": {
            "description": "Site vitrine professionnel développé avec WordPress, conçu pour promouvoir les services de nettoyage auprès des particuliers et des entreprises. Une personnalisation avancée a été réalisée avec HTML et CSS, permettant de créer un design adapté à l'identité de l'entreprise."
        },
        "projetJs": {
            "description": "Projet regroupant une collection de petites fonctionnalités interactives développées en HTML, CSS et JavaScript pur, telles qu’une calculatrice, un convertisseur de devises, un gestionnaire de notes, ou encore des jeux simples comme Pierre-Papier-Ciseaux. Ces projets explorent des concepts clés en JS."
        }
    },
    "formations": {
        "title": "Formations et curriculum vitae",
        "certifications": [
            "2024 : Titre de Concepteur Développeur d'Applications",
            "2023 : Titre de Développeur Web et Web Mobile",
            "2022 : Openclassrooms (HTML / PHP / JS)"
        ],
        "cv": "CV à télécharger"
    },
    "contact": {
        "description": "Retrouvez-moi sur mes réseaux sociaux ou envoyez-moi un email."
    }
}
